intro-to-computers.tex
% Created 2024-06-11 Tue 19:56
% Intended LaTeX compiler: pdflatex
\documentclass[11pt]{article}
\usepackage[utf8]{inputenc}
\usepackage[T1]{fontenc}
\usepackage{graphicx}
\usepackage{longtable}
\usepackage{wrapfig}
\usepackage{rotating}
\usepackage[normalem]{ulem}
\usepackage{amsmath}
\usepackage{amssymb}
\usepackage{capt-of}
\usepackage{hyperref}
\author{Abhijit Bhopatkar}
\date{\today}
\title{Intro To Computers}
\hypersetup{
 pdfauthor={Abhijit Bhopatkar},
 pdftitle={Intro To Computers},
 pdfkeywords={},
 pdfsubject={},
 pdfcreator={Emacs 29.3 (Org mode 9.6.24)}, 
 pdflang={English}}
\begin{document}

\maketitle
\tableofcontents


\section{Modules}
\label{sec:org9d3d39c}
\subsection{Introduction to what is computers and computer science}
\label{sec:org54d3752}
\subsubsection{Computer science is about computers as much as astronomy is about telescopes}
\label{sec:org15ce756}
\subsubsection{History of computers}
\label{sec:orgff823bf}
\subsubsection{Uses of computers}
\label{sec:orga96a375}
\subsubsection{Where computers fail}
\label{sec:org00d5579}
\subsubsection{Operating systems and applications}
\label{sec:orgd6c16ae}
\subsection{Keeping Secrets}
\label{sec:org7e7cf47}
\subsubsection{Keeping things private}
\label{sec:org402f5e7}
\begin{enumerate}
\item Why?
\label{sec:org0299f15}
\item What?
\label{sec:org34b8dd9}
\item How?
\label{sec:orgd01e08a}
\begin{enumerate}
\item Nothing is 100\% safe
\label{sec:org53c24c5}
\end{enumerate}
\end{enumerate}
\subsubsection{Keeping things safe}
\label{sec:orgdca01a1}
\begin{enumerate}
\item Elaborate on How
\label{sec:org4077156}
\item Safety keeping requirements and technologies
\label{sec:orge6c3e53}
\item Passwords/OTP dos and don't
\label{sec:org5386ba0}
\item Practicals
\label{sec:orgf1c44e2}
\item Cracking open the safes
\label{sec:org8eb2aa1}
\end{enumerate}
\subsubsection{Sharing things safely}
\label{sec:org7cce206}
\subsubsection{Basics of encryption (theory and practical)}
\label{sec:org7f47c21}
\subsection{Processing data}
\label{sec:orgc591503}
\subsubsection{What is data}
\label{sec:org48c1826}
\subsubsection{How is data stored}
\label{sec:orgce1909f}
\subsubsection{How is data retrieved}
\label{sec:orge9ed9d7}
\subsubsection{Data processing (Only broad overview)}
\label{sec:orgd4243e9}
\begin{enumerate}
\item Word processing
\label{sec:org839996c}
\item Accounting software
\label{sec:org607d2b8}
\item Data bases
\label{sec:orgec83be7}
\item Spread sheets
\label{sec:org7c3dc9f}
\end{enumerate}
\subsubsection{Using spread sheets to gain insights on data}
\label{sec:org18d09bb}
\begin{enumerate}
\item Co-expertise, Solving math/physics/chemistry problems using computers
\label{sec:org8570277}
\begin{enumerate}
\item Using spreadsheets to graph
\label{sec:org4921204}
\item Using programming to gain more insights
\label{sec:org7414bfe}
\end{enumerate}
\end{enumerate}
\subsection{Introduction to basics of programming}
\label{sec:org9bdd7fa}
\subsubsection{Introduction to algorithms (braking problems down)}
\label{sec:orge7ba09a}
\subsubsection{Introduction to python}
\label{sec:orga187f49}
\subsubsection{Simple practical programs}
\label{sec:orgea1a6f1}
\begin{enumerate}
\item Graphics
\label{sec:org43dfb35}
\item Games
\label{sec:org0bec4c4}
\item Math solvers
\label{sec:orgf2963ba}
\end{enumerate}
\subsection{Internet, web and social media}
\label{sec:orgbfe0448}
\subsubsection{Accessing internet}
\label{sec:orgc13de24}
\begin{enumerate}
\item Web
\label{sec:org8c813de}
\item Messaging
\label{sec:org6a2da1c}
\item Email
\label{sec:orgb071c7f}
\end{enumerate}
\subsubsection{Internet resources}
\label{sec:orgfaa0a40}
\begin{enumerate}
\item Wikipedia
\label{sec:org8ce0f16}
\item Mailing lists
\label{sec:orgb533c54}
\item Social Media
\label{sec:org2ab2396}
\end{enumerate}
\subsubsection{Cloud}
\label{sec:org3369f92}
\begin{enumerate}
\item Concepts
\label{sec:orgfa34127}
\item Cloud storage
\label{sec:org76fe1b8}
\item Services examples (google docs, zoho office)
\label{sec:org63a836f}
\end{enumerate}
\end{document}
